---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SetUp
source: html/5406391e-2f9e-dcf3-76f2-47c99ffb1701.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SetUp Property

The abbreviation of the Set Up (SU) string.

## Syntax (C#)
```csharp
public string SetUp { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null